Autodesk.Revit.DB.ExportEnergyModelType
This enum is used to define if energy model used for gbXML export should be based on rooms/spaces, building elements or analysis mode in EnergyDataSettings.
Since:
2015

Autodesk.Revit.DB.ExportEnergyModelType.AnalysisMode
Energy model based on analysis mode in EnergyDataSettings.